Revit 2027 API
TemporaryGraphicsManager.SetVisibility Method
 Changes the visibility of temporary graphics object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVisibility(
	int index,
	bool visible
)
Public Sub SetVisibility (
	index As Integer,
	visible As Boolean
)
public:
void SetVisibility(
	int index,
	bool visible
)
member SetVisibility :
        index : int *
        visible : bool -> unit
Parameters
index Int32
 Unique index of the temporary graphics object to be updated.
visible Boolean
 if true, it will make the temporary graphics object visible. if false, it will make the temporary graphics object invisible.
Exceptions
Exception | Condition
ArgumentException |  index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace